---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorConversion
source: html/e2aa8fa0-59bf-aa10-10df-bbfb658e18ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorConversion Property

Can't convert Edges to Analytical Model curves.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructWallAnalyticalErrorConversion { get; }
```